app/views/books/_book.html.erb

            <div class="w-3/12"><span>Author/s</span></div>
            <div class="w-9/12"><span><%= book.authors.map { |author| author.full_name } %></span></div>
---
SELECT "authors".* FROM "authors" INNER JOIN "authors_books" ON "authors"."id" = "authors_books"."author_id" WHERE "authors_books"."book_id" = ?  [["book_id", 1]]