app/controllers/books_controller.rb

SELECT "publishers".* FROM "publishers" ORDER BY "publishers"."name" ASC
SELECT "authors".* FROM "authors" ORDER BY "authors"."last_name" ASC
SELECT "publishers".* FROM "publishers" LIMIT ?  [["LIMIT", 11]]
---
  def new
    @book = Book.new
    @publishers = Publisher.all.ordered_by_name
    @authors = Author.all.ordered_by_last_name

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "books" ("title", "isbn_13", "list_price", "publication_year", "publisher_id", "edition", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "publishers".* FROM "publishers" ORDER BY "publishers"."name" ASC
SELECT "authors".* FROM "authors" ORDER BY "authors"."last_name" ASC
---
  def create
    @book = Book.new(book_params)
    author = Author.find(params[:author])
    @book.authors << author

    if @book.save!
      redirect_to @book
    else
      @publishers = Publisher.all.ordered_by_name
      @authors = Author.all.ordered_by_last_name